## **[MySQL AND operator](https://www.mysqltutorial.org/mysql-and/)**

Use the MySQL AND operator to combine multiple Boolean expressions to filter data.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL AND operator

In [3]:
pd.read_sql('select 1 and 1;', engine)

   1 and 1
0        1

In [4]:
pd.read_sql('''
SELECT 1 AND 0, 0 AND 1, 0 AND 0, 0 AND NULL''', engine)

   1 AND 0  0 AND 1  0 AND 0  0 AND NULL
0        0        0        0           0

In [5]:
pd.read_sql('''
SELECT 1 AND NULL, NULL AND NULL''', engine)

  1 AND NULL NULL AND NULL
0       None          None

- Short-circuit evaluation: the expression `1 = 0` returns 0, MySQL can determine the result of the whole expression.

In [6]:
pd.read_sql('SELECT 1 = 0 AND 1 / 0;', engine)

   1 = 0 AND 1 / 0
0                0

### MySQL AND operator examples

In [7]:
string = '''
SELECT customerName, country, state
FROM customers
WHERE country = 'USA' AND state = 'CA';
'''

df1 = pd.read_sql(string, engine)

In [8]:
df2 = (
    pd.read_sql_table('customers', engine)
    .query("country == 'USA' and state == 'CA'")
    [['customerName', 'country', 'state']]
    .reset_index(drop=True)
)

In [9]:
df1.equals(df2)

True

In [10]:
df1.head()

                   customerName country state
0  Mini Gifts Distributors Ltd.     USA    CA
1               Mini Wheels Co.     USA    CA
2          Technics Stores Inc.     USA    CA
3             Toys4GrownUps.com     USA    CA
4             Boards & Toys Co.     USA    CA

In [11]:
string = '''
SELECT customerName, country, state, creditLimit
FROM customers
WHERE country = 'USA' AND state = 'CA' AND creditLimit > 100000;
'''

pd.read_sql(string, engine)

                   customerName country state  creditLimit
0  Mini Gifts Distributors Ltd.     USA    CA     210500.0
1  Collectable Mini Designs Co.     USA    CA     105000.0
2      Corporate Gift Ideas Co.     USA    CA     105000.0

In [12]:
(pd.read_sql_table('customers', engine)
 .query("country == 'USA' and state == 'CA' and creditLimit > 100000")
 [['customerName', 'country', 'state', 'creditLimit']]
 .reset_index(drop=True)
)

                   customerName country state  creditLimit
0  Mini Gifts Distributors Ltd.     USA    CA     210500.0
1  Collectable Mini Designs Co.     USA    CA     105000.0
2      Corporate Gift Ideas Co.     USA    CA     105000.0